Repository: offyotto/Core-Monitor
Catalog: Core-Monitor/Localizable.xcstrings
Source language: en
Languages: af, am, ar, az, be, bg, bn, bs, ca, ceb, co, cs, cy, da, de, el, eo, es, et, eu, fa, fi, fil, fr, fy, ga, gd, gl, gu, ha, haw, he, hi, hmn, hr, ht, hu, hy, id, ig, is, it, ja, jv, ka, kk, km, kn, ko, ku, ky, la, lb, lo, lt, lv, mg, mi, mk, ml, mn, mr, ms, mt, my, nb, ne, nl, ny, pa, pl, ps, pt, ro, ru, sd, si, sk, sl, sm, sn, so, sq, st, su, sv, sw, ta, te, tg, th, tr, uk, ur, uz, vi, xh, yi, yo, zh_hans, zh_hant, zu

source: Fan key scans are diagnostic only. They confirm which fan-related SMC keys respond on this Mac; they do not calibrate RPM accuracy or guarantee every preset is safe.
af: Waaiersleutelskanderings is slegs diagnosties. Hulle bevestig watter waaierverwante SMC-sleutels op hierdie Mac reageer; hulle kalibreer nie RPM akkuraatheid of waarborg dat elke voorafinstelling veilig is nie.
am: የደጋፊ ቁልፍ ቅኝቶች የምርመራ ብቻ ናቸው። ከአድናቂዎች ጋር የተገናኙ SMC ቁልፎች በዚህ Mac ላይ ምላሽ እንደሚሰጡ ያረጋግጣሉ; የRPM ትክክለኛነትን አያስተካክሉም ወይም እያንዳንዱ ቅድመ ዝግጅት ደህንነቱ የተጠበቀ መሆኑን ዋስትና አይሰጡም።
ar: عمليات فحص مفتاح المروحة هي تشخيصية فقط. وهي تؤكد أي مفاتيح SMC ذات الصلة بالمروحة تستجيب على جهاز Mac هذا؛ إنهم لا يقومون بمعايرة دقة RPM أو يضمنون أن كل إعداد مسبق آمن.
az: Fan açarlarının skanları yalnız diaqnostikdir. Onlar bu Mac-da hansı fanla əlaqəli SMC düymələrinin cavab verdiyini təsdiqləyir; onlar RPM dəqiqliyini kalibrləmir və ya hər bir əvvəlcədən təyinin təhlükəsiz olmasına zəmanət vermirlər.
be: Сканаванне ключоў вентылятара з'яўляецца толькі дыягнастычным. Яны пацвярджаюць, якія звязаныя з вентылятарамі клавішы SMC працуюць на гэтым Mac; яны не калібруюць дакладнасць RPM і не гарантуюць бяспеку кожнай перадусталёўкі.
bg: Сканирането на ключовете на вентилатора е само диагностично. Те потвърждават кои клавиши SMC, свързани с вентилатора, отговарят на този Mac; те не калибрират точността на RPM или гарантират, че всяка предварителна настройка е безопасна.
bn: ফ্যান কী স্ক্যান শুধুমাত্র ডায়াগনস্টিক। তারা নিশ্চিত করে যে কোন ফ্যান-সম্পর্কিত SMC কীগুলি এই ম্যাকে প্রতিক্রিয়া জানায়; তারা RPM নির্ভুলতা ক্যালিব্রেট করে না বা প্রতিটি প্রিসেট নিরাপদের গ্যারান্টি দেয় না।
bs: Skeniranje ključa ventilatora je samo dijagnostičko. Oni potvrđuju koje tipke SMC koje se odnose na ventilator odgovaraju na ovom Macu; oni ne kalibriraju RPM tačnost niti garantuju da je svaki unapred podešen siguran.
ca: Les exploracions de claus del ventilador només són de diagnòstic. Confirmen quines tecles SMC relacionades amb el ventilador responen en aquest Mac; no calibren la precisió de RPM ni garanteixen que tots els valors predefinits siguin segurs.
ceb: Ang fan key scan kay diagnostic lang. Gikumpirma nila kung unsang mga yawe nga adunay kalabotan sa fan SMC ang motubag niini nga Mac; wala nila gi-calibrate ang katukma sa RPM o gigarantiyahan nga luwas ang matag preset.
co: I scans di chjave di i fan sò solu diagnostichi. Cunfirmanu chì e chjavi SMC di fan-related rispondenu in questa Mac; ùn calibranu micca a precisione RPM o guarantisci chì ogni preset hè sicuru.
cs: Skenování klíčů ventilátoru je pouze diagnostické. Potvrzují, které klávesy SMC související s fanoušky na tomto Macu reagují; nekalibrují přesnost RPM ani nezaručují bezpečnost každé předvolby.
cy: Mae sganiau bysellau ffan yn ddiagnostig yn unig. Maent yn cadarnhau pa allweddi SMC sy'n gysylltiedig â ffan sy'n ymateb ar y Mac hwn; nid ydynt yn graddnodi cywirdeb RPM nac yn gwarantu bod pob rhagosodiad yn ddiogel.
da: Fantastscanninger er kun diagnostiske. De bekræfter, hvilke fan-relaterede SMC-nøgler, der svarer på denne Mac; de kalibrerer ikke RPM nøjagtighed eller garanterer, at hver forudindstilling er sikker.
de: Lüfterschlüssel-Scans dienen nur der Diagnose. Sie bestätigen, welche lüfterbezogenen SMC-Tasten auf diesem Mac reagieren; Sie kalibrieren weder die RPM-Genauigkeit noch garantieren sie, dass jede Voreinstellung sicher ist.
el: Οι σαρώσεις πλήκτρων ανεμιστήρα είναι μόνο διαγνωστικές. Επιβεβαιώνουν ποια πλήκτρα SMC που σχετίζονται με ανεμιστήρες αποκρίνονται σε αυτόν τον Mac. δεν βαθμονομούν την ακρίβεια RPM ούτε εγγυώνται ότι κάθε προεπιλογή είναι ασφαλής.
eo: Fanŝlosilo-skanado estas nur diagnozaj. Ili konfirmas, kiuj fan-rilataj SMC-ŝlosiloj respondas sur ĉi tiu Mac; ili ne kalibras RPM-precizecon aŭ garantias, ke ĉiu antaŭdiro estas sekura.
es: Los escaneos de las teclas del ventilador son solo de diagnóstico. Confirman qué teclas SMC relacionadas con el ventilador responden en esta Mac; no calibran la precisión del RPM ni garantizan que cada ajuste preestablecido sea seguro.
et: Ventilaatoriklahvi skaneerimine on ainult diagnostiline. Need kinnitavad, millised ventilaatoriga seotud SMC-klahvid sellel Macil reageerivad; need ei kalibreeri RPM täpsust ega garanteeri, et iga eelseade on ohutu.
eu: Fan gakoen bilaketak diagnostikoak dira soilik. Berresten dute zaleekin erlazionatutako SMC teklak erantzuten duten Mac honetan; ez dute RPM zehaztasuna kalibratzen edo aurrez ezarritako bakoitza segurua dela bermatzen.
fa: اسکن کلید فن فقط تشخیصی است. آنها تأیید می کنند که کدام کلیدهای SMC مربوط به فن در این مک پاسخ می دهند. آنها دقت RPM را کالیبره نمی کنند یا تضمین نمی کنند که هر پیش تنظیمی ایمن است.
fi: Tuulettimen näppäinskannaukset ovat vain diagnostisia. Ne vahvistavat, mitkä tuulettimeen liittyvät SMC-näppäimet vastaavat tässä Macissa; ne eivät kalibroi RPM-tarkkuutta tai takaa jokaisen esiasetuksen olevan turvallista.
fil: Ang mga fan key scan ay diagnostic lamang. Kinukumpirma nila kung aling mga SMC key na nauugnay sa fan ang tumutugon sa Mac na ito; hindi nila na-calibrate ang katumpakan ng RPM o ginagarantiyahan na ligtas ang bawat preset.
fr: Les analyses des clés de ventilateur sont uniquement destinées au diagnostic. Ils confirment quelles touches SMC liées aux fans répondent sur ce Mac ; ils ne calibrent pas la précision du RPM et ne garantissent pas la sécurité de chaque préréglage.
fy: Fan-kaai-scans binne allinich diagnostysk. Se befêstigje hokker fan-relatearre SMC kaaien reagearje op dizze Mac; se kalibrearje gjin RPM-krektens of garandearje dat elke preset feilich is.
ga: Is scanadh diagnóiseach amháin iad na heochracha lucht leanúna. Deimhníonn siad cé na heochracha SMC a bhaineann le lucht leanúna a fhreagraíonn ar an Mac seo; ní chalabraíonn siad cruinneas RPM agus ní ráthaíonn siad go bhfuil gach réamhshocrú sábháilte.
gd: Tha sganaidhean iuchrach luchd-leantainn a’ dèanamh breithneachadh a-mhàin. Bidh iad a’ dearbhadh dè na h-iuchraichean SMC co-cheangailte ri luchd-leantainn a fhreagras air a’ Mac seo; chan eil iad a’ calibachadh cruinneas RPM no a’ gealltainn gu bheil a h-uile ro-aithris sàbhailte.
gl: As exploracións de teclas do ventilador son só de diagnóstico. Confirman que teclas SMC relacionadas co ventilador responden neste Mac; non calibran a precisión RPM nin garanten que cada preselección sexa segura.
gu: ફેન કી સ્કેન માત્ર ડાયગ્નોસ્ટિક છે. તેઓ પુષ્ટિ કરે છે કે આ Mac પર કઈ ચાહક-સંબંધિત SMC કી પ્રતિસાદ આપે છે; તેઓ RPM ચોકસાઈનું માપાંકન કરતા નથી અથવા દરેક પ્રીસેટ સલામત હોવાની ખાતરી આપતા નથી.
ha: Binciken maɓalli na fan bincike ne kawai. Sun tabbatar da waɗanne maɓallan SMC masu alaƙa sun amsa akan wannan Mac; Ba sa daidaita daidaiton RPM ko garantin kowane saiti yana da aminci.
haw: ʻO nā kiʻi kiʻi pā he diagnostic wale nō. Hoʻopaʻa lākou i nā kī SMC pili i ka peʻa e pane ai ma kēia Mac; ʻAʻole lākou e calibrate i ka pololei RPM a i ʻole e hōʻoia i ka palekana o kēlā me kēia preset.
he: סריקות מפתח מאוורר הן אבחון בלבד. הם מאשרים אילו מקשי SMC קשורים למאווררים מגיבים ב-Mac זה; הם לא מכיילים את דיוק RPM או מבטיחים שכל הגדרה מראש בטוחה.
hi: फैन कुंजी स्कैन केवल डायग्नोस्टिक हैं। वे पुष्टि करते हैं कि इस मैक पर कौन सी प्रशंसक-संबंधित SMC कुंजियाँ प्रतिक्रिया देती हैं; वे RPM सटीकता को कैलिब्रेट नहीं करते हैं या गारंटी नहीं देते हैं कि प्रत्येक प्रीसेट सुरक्षित है।
hmn: Cov kiv cua tseem ceeb scans tsuas yog kuaj xwb. Lawv paub meej tias tus kiv cua cuam tshuam txog SMC cov yawm sij teb ntawm Mac no; lawv tsis calibrate RPM qhov tseeb lossis lav txhua qhov preset muaj kev nyab xeeb.
hr: Skeniranje ključeva ventilatora samo je dijagnostičko. One potvrđuju koje SMC tipke povezane s ventilatorom reagiraju na ovom Macu; oni ne kalibriraju RPM točnost niti jamče da je svaka prednamještena sigurna.
ht: Analiz kle fanatik yo se dyagnostik sèlman. Yo konfime ki kle SMC ki gen rapò ak fanatik ki reponn sou Mac sa a; yo pa kalibre RPM presizyon oswa garanti chak prereglaj an sekirite.
hu: A ventilátorbillentyűk vizsgálata csak diagnosztikai jellegű. Megerősítik, hogy ezen a Macen mely ventilátorral kapcsolatos SMC billentyűk reagálnak; nem kalibrálják a RPM pontosságát, és nem garantálják, hogy minden előre beállított érték biztonságos.
hy: Օդափոխիչի ստեղների սկանավորումը միայն ախտորոշիչ է: Նրանք հաստատում են, թե որ երկրպագուների հետ կապված SMC ստեղները արձագանքում են այս Mac-ում; նրանք չեն չափում RPM ճշգրտությունը կամ երաշխավորում են, որ յուրաքանչյուր նախադրյալ անվտանգ է:
id: Pemindaian tombol kipas hanya bersifat diagnostik. Mereka mengonfirmasi tombol SMC terkait kipas mana yang merespons pada Mac ini; mereka tidak mengkalibrasi akurasi RPM atau menjamin setiap preset aman.
ig: Nyocha igodo fan bụ naanị nyocha. Ha na-akwado igodo SMC metụtara fan zara na Mac a; ha anaghị ahazi RPM izi ezi ma ọ bụ kwe nkwa na edobere ọ bụla adịghị mma.
is: Skannanir á viftulykla eru eingöngu til greiningar. Þeir staðfesta hvaða viftutengdu SMC lyklar svara á þessum Mac; þeir kvarða ekki RPM nákvæmni eða tryggja að sérhver forstilling sé örugg.
it: Le scansioni della chiave della ventola sono solo diagnostiche. Confermano quali tasti SMC relativi alla ventola rispondono su questo Mac; non calibrano la precisione RPM né garantiscono che ogni preimpostazione sia sicura.
ja: ファン キー スキャンは診断のみを目的としています。彼らは、この Mac でどのファン関連の SMC キーが応答するかを確認しました。 RPM の精度を調整したり、すべてのプリセットが安全であることを保証したりするものではありません。
jv: Pindai tombol kipas mung diagnostik. Padha konfirmasi tombol SMC sing gegandhengan karo penggemar sing nanggapi ing Mac iki; padha ora calibrate RPM akurasi utawa njamin saben prasetel aman.
ka: ვენტილატორის გასაღების სკანირება მხოლოდ დიაგნოსტიკურია. ისინი ადასტურებენ, რომელ SMC კლავიშებთან დაკავშირებული კლავიშები პასუხობენ ამ Mac-ზე; ისინი არ კალიბრირებენ RPM სიზუსტეს და არ აძლევენ გარანტიას, რომ ყველა წინასწარ დაყენება უსაფრთხოა.
kk: Желдеткіш пернелерді сканерлеу тек диагностикалық болып табылады. Олар осы Mac жүйесінде қандай желдеткішке қатысты SMC пернелерінің жауап беретінін растайды; олар RPM дәлдігін калибрлемейді немесе әрбір алдын ала орнатудың қауіпсіз екеніне кепілдік бермейді.
km: ការស្កេនគន្លឹះរបស់អ្នកគាំទ្រគឺគ្រាន់តែធ្វើរោគវិនិច្ឆ័យប៉ុណ្ណោះ។ ពួកគេបញ្ជាក់ថា គ្រាប់ចុច SMC ដែលទាក់ទងនឹងអ្នកគាំទ្រឆ្លើយតបនៅលើ Mac នេះ; ពួកគេមិនធ្វើក្រិត RPM ភាពត្រឹមត្រូវ ឬធានារាល់ការកំណត់ជាមុនគឺមានសុវត្ថិភាព។
kn: ಫ್ಯಾನ್ ಕೀ ಸ್ಕ್ಯಾನ್‌ಗಳು ರೋಗನಿರ್ಣಯಕ್ಕೆ ಮಾತ್ರ. ಈ ಮ್ಯಾಕ್‌ನಲ್ಲಿ ಯಾವ ಫ್ಯಾನ್-ಸಂಬಂಧಿತ SMC ಕೀಗಳು ಪ್ರತಿಕ್ರಿಯಿಸುತ್ತವೆ ಎಂಬುದನ್ನು ಅವರು ಖಚಿತಪಡಿಸುತ್ತಾರೆ; ಅವರು RPM ನಿಖರತೆಯನ್ನು ಮಾಪನಾಂಕ ಮಾಡುವುದಿಲ್ಲ ಅಥವಾ ಪ್ರತಿ ಪೂರ್ವನಿಗದಿ ಸುರಕ್ಷಿತವಾಗಿದೆ ಎಂದು ಖಾತರಿಪಡಿಸುವುದಿಲ್ಲ.
ko: 팬 키 스캔은 진단용으로만 사용됩니다. 이 Mac에서 어떤 팬 관련 SMC 키가 응답하는지 확인합니다. RPM 정확도를 보정하거나 모든 사전 설정이 안전하다고 보장하지 않습니다.
ku: Skandinên mifteya Fan tenê teşhîs in. Ew piştrast dikin ka kîjan bişkojkên SMC-girêdayî fan li ser vê Mac-ê bersiv didin; ew rastbûna RPM kalibr nakin an garantî nakin ku her pêşnumayek ewledar e.
ky: Желдетүүчү баскычтарды сканерлөө диагностикалык гана болуп саналат. Алар бул Macта күйөрманга тиешелүү SMC баскычтары жооп берет; алар RPM тактыгын калибрлебейт же ар бир алдын ала коюлган коопсуз деп кепилдик беришпейт.
la: Fan clavis lustrat diagnostica tantum. Confirmant quae claves ventilabrum SMC huic Mac respondent; RPM accurationem non calibrate vel omne presulum securum spondent.
lb: Fan Schlëssel Scans sinn nëmmen diagnostesch. Si confirméieren déi Fan-Zesummenhang SMC Schlësselen op dëser Mac reagéieren; si kalibréieren net RPM Genauegkeet oder garantéieren datt all Preset sécher ass.
lo: ການສະແກນກະແຈພັດລົມແມ່ນການວິນິໄສເທົ່ານັ້ນ. ພວກເຂົາຢືນຢັນວ່າປຸ່ມ SMC ທີ່ກ່ຽວຂ້ອງກັບພັດລົມໃດຕອບສະໜອງໃນ Mac ນີ້; ພວກເຂົາບໍ່ໄດ້ປັບທຽບຄວາມຖືກຕ້ອງຂອງ RPM ຫຼືຮັບປະກັນວ່າທຸກໆ preset ແມ່ນປອດໄພ.
lt: Ventiliatoriaus klavišų nuskaitymas yra tik diagnostinis. Jie patvirtina, kurie su ventiliatoriumi susiję SMC klavišai reaguoja šiame „Mac“; jie nesukalibruoja RPM tikslumo ir negarantuoja, kad kiekvienas išankstinis nustatymas yra saugus.
lv: Ventilatora taustiņu skenēšana ir tikai diagnostiska. Tie apstiprina, kuri ar ventilatoru saistītie SMC taustiņi reaģē šajā Mac datorā; tie nekalibrē RPM precizitāti un negarantē, ka katrs iepriekšējais iestatījums ir drošs.
mg: Ny scan fan key dia diagnostic ihany. Manamafy izy ireo hoe iza amin'ireo fanalahidy SMC mifandray amin'ny mpankafy no mamaly amin'ity Mac ity; tsy manao calibrate RPM izy ireo na manome antoka fa azo antoka ny preset rehetra.
mi: He tātaritanga anake nga matawai matua. Ka whakauhia e ratou ko nga taviri SMC e pa ana ki te kaiwhaiwhai e whakautu ana ki tenei Mac; kare ratou e whakataurite i te tika RPM, e kii ana ranei kei te haumaru nga tatūkē katoa.
mk: Скенирањето на копчињата на вентилаторот е само дијагностички. Тие потврдуваат кои копчиња SMC поврзани со вентилаторот реагираат на овој Mac; тие не ја калибрираат точноста на RPM или гарантираат дека секое претходно поставено е безбедно.
ml: ഫാൻ കീ സ്കാനുകൾ ഡയഗ്നോസ്റ്റിക് മാത്രമാണ്. ഫാനുമായി ബന്ധപ്പെട്ട ഏത് SMC കീകളാണ് ഈ Mac-ൽ പ്രതികരിക്കുന്നതെന്ന് അവർ സ്ഥിരീകരിക്കുന്നു; അവർ RPM കൃത്യത കാലിബ്രേറ്റ് ചെയ്യുന്നില്ല അല്ലെങ്കിൽ എല്ലാ പ്രീസെറ്റും സുരക്ഷിതമാണെന്ന് ഉറപ്പുനൽകുന്നില്ല.
mn: Сэнсний түлхүүрийн сканнер нь зөвхөн оношлогооны зориулалттай. Тэд энэ Mac дээр ямар фентэй холбоотой SMC товчлуурууд хариу өгөхийг баталгаажуулдаг; тэд RPM-ийн нарийвчлалыг тохируулдаггүй эсвэл урьдчилан тохируулсан бүх зүйл аюулгүй гэдгийг баталгаажуулдаггүй.
mr: फॅन की स्कॅन फक्त निदान आहेत. या Mac वर कोणत्या फॅनशी संबंधित SMC की प्रतिसाद देतात याची ते पुष्टी करतात; ते RPM अचूकता कॅलिब्रेट करत नाहीत किंवा प्रत्येक प्रीसेट सुरक्षित असल्याची हमी देत ​​नाहीत.
ms: Imbasan kunci kipas adalah diagnostik sahaja. Mereka mengesahkan kekunci SMC berkaitan kipas yang bertindak balas pada Mac ini; mereka tidak menentukur ketepatan RPM atau menjamin setiap pratetap adalah selamat.
mt: L-iskans taċ-ċavetta tal-fann huma dijanjostiċi biss. Huma jikkonfermaw liema ċwievet SMC relatati mal-fann jirrispondu fuq dan il-Mac; ma jikkalibrawx l-eżattezza RPM jew jiggarantixxu li kull issettjat minn qabel huwa sigur.
my: ပန်ကာသော့စကင်န်များသည် ရောဂါရှာဖွေခြင်းသာဖြစ်သည်။ ဤ Mac တွင် ပန်ကာနှင့်သက်ဆိုင်သည့် SMC သော့များ တုံ့ပြန်ကြောင်း အတည်ပြုသည်။ ၎င်းတို့သည် RPM တိကျမှုကို ချိန်ညှိခြင်းမပြုပါ သို့မဟုတ် ကြိုတင်သတ်မှတ်မှုတိုင်းသည် ဘေးကင်းကြောင်း အာမခံပါသည်။
nb: Viftenøkkelskanninger er kun diagnostiske. De bekrefter hvilke vifterelaterte SMC-nøkler som svarer på denne Macen; de kalibrerer ikke RPM nøyaktighet eller garanterer at hver forhåndsinnstilling er trygg.
ne: फ्यान कुञ्जी स्क्यान मात्र निदान हो। तिनीहरूले यो म्याकमा कुन फ्यान-सम्बन्धित SMC कुञ्जीहरू जवाफ दिन्छन् भनेर पुष्टि गर्छन्; तिनीहरूले RPM सटीकता क्यालिब्रेट गर्दैनन् वा प्रत्येक प्रिसेट सुरक्षित छ भन्ने ग्यारेन्टी गर्दैनन्।
nl: Fankey-scans zijn alleen diagnostisch. Ze bevestigen welke ventilatorgerelateerde SMC-toetsen op deze Mac reageren; ze kalibreren de nauwkeurigheid van de RPM niet en garanderen niet dat elke voorinstelling veilig is.
ny: Makani a makiyi amafani ndi matenda okha. Amatsimikizira makiyi okhudzana ndi SMC omwe amayankha pa Mac iyi; samayesa kulondola kwa RPM kapena kutsimikizira kukhazikitsidwa kulikonse kuli kotetezeka.
pa: ਪੱਖਾ ਕੁੰਜੀ ਸਕੈਨ ਸਿਰਫ਼ ਡਾਇਗਨੌਸਟਿਕ ਹਨ। ਉਹ ਪੁਸ਼ਟੀ ਕਰਦੇ ਹਨ ਕਿ ਇਸ ਮੈਕ 'ਤੇ ਕਿਹੜੀਆਂ ਪ੍ਰਸ਼ੰਸਕ-ਸਬੰਧਤ SMC ਕੁੰਜੀਆਂ ਜਵਾਬ ਦਿੰਦੀਆਂ ਹਨ; ਉਹ RPM ਸ਼ੁੱਧਤਾ ਨੂੰ ਕੈਲੀਬਰੇਟ ਨਹੀਂ ਕਰਦੇ ਜਾਂ ਹਰ ਪ੍ਰੀਸੈਟ ਸੁਰੱਖਿਅਤ ਹੋਣ ਦੀ ਗਰੰਟੀ ਨਹੀਂ ਦਿੰਦੇ ਹਨ।
pl: Skanowanie kluczyka wentylatora ma wyłącznie charakter diagnostyczny. Potwierdzają, które klawisze SMC związane z wentylatorem odpowiadają na tym komputerze Mac; nie kalibrują dokładności RPM ani nie gwarantują, że każde ustawienie wstępne jest bezpieczne.
ps: د فین کلیدي سکین یوازې تشخیصي دي. دوی تاییدوي چې کوم فین پورې اړوند SMC کیلي پدې میک کې ځواب ورکوي؛ دوی د RPM دقت اندازه نه کوي یا تضمین کوي ​​​​چې هر مخکینۍ خوندي وي.
pt: As varreduras das teclas do ventilador são apenas para diagnóstico. Eles confirmam quais teclas SMC relacionadas ao ventilador respondem neste Mac; eles não calibram a precisão do RPM nem garantem que cada predefinição seja segura.
ro: Scanările cheilor ventilatorului sunt doar de diagnosticare. Ei confirmă ce taste SMC legate de ventilator răspund pe acest Mac; nu calibrează acuratețea RPM și nu garantează că fiecare presetare este sigură.
ru: Сканирование клавиш вентилятора предназначено только для диагностики. Они подтверждают, какие клавиши SMC, связанные с вентилятором, реагируют на этом Mac; они не калибруют точность RPM и не гарантируют безопасность каждой предустановки.
sd: فين ڪي اسڪين صرف تشخيصي آهن. اهي تصديق ڪن ٿا ته ڪهڙي فين سان لاڳاپيل SMC چابيون هن Mac تي جواب ڏين ٿيون؛ اهي RPM جي درستگي کي درست نٿا ڪن يا ضمانت ڏين ٿا ته هر پيش ڪيل محفوظ آهي.
si: පංකා යතුරු ස්කෑන් රෝග විනිශ්චය පමණි. ඔවුන් මෙම Mac මත ප්‍රතිචාර දක්වන විදුලි පංකා සම්බන්ධ SMC යතුරු තහවුරු කරයි; ඔවුන් RPM නිරවද්‍යතාවය ක්‍රමාංකනය නොකරයි හෝ සෑම පෙරසිටුවක්ම ආරක්ෂිත බව සහතික නොකරයි.
sk: Skenovanie kľúčov ventilátora je len diagnostické. Potvrdzujú, ktoré klávesy SMC súvisiace s fanúšikmi reagujú na tomto Macu; nekalibrujú presnosť RPM ani nezaručujú bezpečnosť každej predvoľby.
sl: Pregledi tipk ventilatorja so samo diagnostični. Potrjujejo, katere tipke SMC, povezane z ventilatorji, se odzivajo na tem Macu; ne umerjajo natančnosti RPM ali zagotavljajo, da je vsaka prednastavitev varna.
sm: O su'esu'ega ki ili e na'o su'esu'ega. Latou te faʻamaonia poʻo fea ki e fesoʻotaʻi ma le SMC e tali mai i lenei Mac; latou te le fa'avasegaina RPM sa'o pe fa'amautinoa e saogalemu uma seti.
sn: Fan key scans ndeyekuongorora chete. Vanosimbisa kuti ndeapi makiyi ane hukama neSMC anopindura paMac iyi; ivo havatarise RPM kurongeka kana vimbiso yega yega preset yakachengeteka.
so: Sawirada furaha taageerayaashu waa ogaanshaha kaliya. Waxay xaqiijinayaan furayaasha SMC ee taageeraha ku xidhan ee ka jawaabaya Mac-gan; ma saxayaan saxnaanta RPM mana dammaanad qaadayaan in horay loo dhigay uu badbaado leeyahay.
sq: Skanimet e çelësave të ventilatorit janë vetëm diagnostikuese. Ata konfirmojnë se cilët çelësa SMC të lidhura me tifozët përgjigjen në këtë Mac; ata nuk e kalibrojnë saktësinë RPM ose nuk garantojnë se çdo paravendosje është e sigurt.
st: Litlhahlobo tsa linotlolo tsa fan ke tsa tlhahlobo feela. Ba tiisa hore na ke linotlolo life tse amanang le fan SMC tse arabelang ho Mac ena; ha ba lekanye ho nepahala ha RPM kapa ho netefatsa hore setlhophiso se seng le se seng se bolokehile.
su: Scan konci kipas ngan ukur diagnostik. Aranjeunna mastikeun mana konci SMC anu aya hubunganana sareng kipas ngabales dina Mac ieu; aranjeunna henteu calibrate akurasi RPM atanapi ngajamin unggal prasetél aman.
sv: Fläktnyckelskanningar är endast diagnostiska. De bekräftar vilka fläktrelaterade SMC-nycklar som svarar på denna Mac; de kalibrerar inte RPM-noggrannheten eller garanterar att varje förinställning är säker.
sw: Uchanganuzi wa vitufe vya mashabiki ni uchunguzi pekee. Wanathibitisha ni funguo zipi za SMC zinazohusiana na shabiki kujibu kwenye Mac hii; hazidhibiti usahihi wa RPM au kuhakikisha kila uwekaji mapema uko salama.
ta: ஃபேன் கீ ஸ்கேன்கள் மட்டுமே கண்டறியும். இந்த Mac இல் எந்த விசிறி தொடர்பான SMC விசைகள் பதிலளிக்கின்றன என்பதை அவை உறுதிப்படுத்துகின்றன; அவை RPM துல்லியத்தை அளவீடு செய்யாது அல்லது ஒவ்வொரு முன்னமைவும் பாதுகாப்பானது என்று உத்தரவாதம் அளிக்காது.
te: ఫ్యాన్ కీ స్కాన్‌లు రోగనిర్ధారణ మాత్రమే. ఈ Macలో ఏ ఫ్యాన్-సంబంధిత SMC కీలు ప్రతిస్పందిస్తాయో వారు నిర్ధారిస్తారు; వారు RPM ఖచ్చితత్వాన్ని క్రమాంకనం చేయరు లేదా ప్రతి ప్రీసెట్ సురక్షితమని హామీ ఇవ్వరు.
tg: Сканҳои калидҳои мухлиси танҳо ташхис мебошанд. Онҳо тасдиқ мекунанд, ки кадом калидҳои марбут ба мухлиси SMC дар ин Mac ҷавоб медиҳанд; онҳо дақиқии RPM-ро калибровк намекунанд ё кафолат медиҳанд, ки ҳар як танзимоти пешакӣ бехатар аст.
th: การสแกนคีย์พัดลมเป็นเพียงการวินิจฉัยเท่านั้น พวกเขายืนยันว่าคีย์ SMC ที่เกี่ยวข้องกับพัดลมตัวใดที่ตอบสนองบน Mac เครื่องนี้ พวกเขาไม่ได้ปรับเทียบความแม่นยำของ RPM หรือรับประกันว่าทุกค่าที่ตั้งล่วงหน้าจะปลอดภัย
tr: Fan anahtarı taramaları yalnızca teşhis amaçlıdır. Bu Mac'te hangi fanla ilgili SMC tuşlarının yanıt verdiğini doğruluyorlar; RPM doğruluğunu kalibre etmezler veya her ön ayarın güvenli olduğunu garanti etmezler.
uk: Сканування клавіш вентилятора є лише діагностичним. Вони підтверджують, які пов’язані з вентилятором клавіші SMC відповідають на цьому Mac; вони не калібрують точність RPM і не гарантують безпечність кожного попереднього налаштування.
ur: پنکھے کی کلید کے اسکینز صرف تشخیصی ہیں۔ وہ اس بات کی تصدیق کرتے ہیں کہ کون سی فین سے متعلقہ SMC کیز اس میک پر جواب دیتی ہیں۔ وہ RPM درستگی کیلیبریٹ نہیں کرتے ہیں یا ہر پیش سیٹ کے محفوظ ہونے کی ضمانت نہیں دیتے ہیں۔
uz: Fan kalitlarini skanerlash faqat diagnostika uchun mo'ljallangan. Ular ushbu Macda qaysi fan bilan bog'liq SMC tugmalari javob berishini tasdiqlaydi; ular RPM aniqligini kalibrlamaydi yoki har bir oldindan o'rnatilgan xavfsizlikni kafolatlamaydi.
vi: Quét phím quạt chỉ mang tính chất chẩn đoán. Họ xác nhận các phím SMC liên quan đến quạt nào phản hồi trên máy Mac này; họ không hiệu chỉnh độ chính xác của RPM hoặc đảm bảo mọi cài đặt trước đều an toàn.
xh: Ukuskena kwamaqhosha eFan luxilongo kuphela. Baqinisekisa ukuba zeziphi izitshixo ze-SMC ezinxulumene nabalandeli ziphendula kule Mac; azilinganisi RPM ukuchaneka okanye ziqinisekisa zonke iiseti zangaphambili zikhuselekile.
yi: פאָכער שליסל סקאַנז זענען בלויז דיאַגנאָסטיק. זיי באַשטעטיקן וואָס פאָכער-פֿאַרבונדענע SMC שליסלען ריספּאַנד אויף דעם מעק; זיי טאָן ניט קאַלאַברייט RPM אַקיעראַסי אָדער גאַראַנטירן אַז יעדער פּריסעט איז זיכער.
yo: Awọn ọlọjẹ bọtini àìpẹ jẹ iwadii aisan nikan. Wọn jẹrisi iru awọn bọtini SMC ti o ni ibatan ti o dahun lori Mac yii; wọn ko ṣe iwọn deede RPM tabi ṣe iṣeduro gbogbo tito tẹlẹ jẹ ailewu.
zh_hans: 风扇按键扫描仅用于诊断。他们确认了哪些与风扇相关的 SMC 按键在此 Mac 上有响应；他们不校准 RPM 精度或保证每个预设都是安全的。
zh_hant: 風扇按鍵掃描僅用於診斷。他們確認了哪些與風扇相關的 SMC 按鍵在此 Mac 上有響應；他們不校準 RPM 精度或保證每個預設都是安全的。
zu: Ukuskena kokhiye babalandeli kuwukuhlola kuphela. Baqinisekisa ukuthi yibaphi okhiye be-SMC abahlobene nabalandeli abaphendulayo kule Mac; azilinganisi ukunemba kwe-RPM noma ziqinisekisa ukuthi konke ukusetha ngaphambilini kuphephile.
